import React from "react";

const IntroduceCourse = () => {
  return (
    <div className=" container max-w-[1320px] mx-auto font-iransans mt-16">
      <p className=" text-2xl font-semibold">معرفی دوره</p>
      <article className=" mt-4 leading-8 ml-20 text-gray-800 w-3/5">
        داده کاوی و یادگیری ماشین زمانی جذاب است که شما یک تحلیل‌گر داده حرفه‌ای
        باشید و نه فقط در آرزوی انجام آن. اگر می‌خواهید‌ از الان تا آینده
        خیال‌تان را بابت داشتن یک شغل خوب و خوش‌درآمد در هرجای جهان راحت کنید و
        با خیال آسوده پیر شوید، یادگیری داده کاوی و ماشین لرنینگ همان مهارتی‌ست
        که جادوگرها در گوی آینده‌نمای خود می‌بینند. آموزش پایتون برای داده‌کاوی
        چیزی‌ست که بلندپروازها و افراد جسور نمی‌توانند در برابر یادگیری آن
        مقاومت کنند. حالا که در انتخاب این حوزه جسارت لازم را دارید، بهتر است
        ادامه راه را هم بررسی کنیم و ببینیم چه مسیر مطمئنی برای یادگیری علم داده
        با پایتون در پیش‌رو داریم. دوره‌ متخصص یادگیری ماشین و علم داده با هدف
        تدریس تمامی مباحث و سرفصل‌های لازم برای تسلط و آمادگی دانشجویان جهت ورود
        به بازار کار ارائه شده است. در این دوره‌‌ کامل‌ترین سرفصل‌های پایتون
        برای داده کاوی به صورت غیرحضوری تدریس می‌شود و دانشجویان پس از مشاهده
        جلسات امکان پرسش و پاسخ، رفع اشکال، انجام تمرین، انجام آزمون‌های مقطعی و
        رتبه‌بندی خواهند داشت.
      </article>
    </div>
  );
};

export default IntroduceCourse;
