import React from "react";

const BlogText = () => {
  return (
    <article className="  mt-10 text-justify leading-9 px-24 font-thin text-gray-500">
      ما اغلب برای حل مشکلات به دنبال ساده‌ترین و سریع‌ترین راه‌حل‌ها هستیم.
      سال‌ها است که علم با یافتن پاسخ سؤالات خود و استفاده از آن‌ها در
      پیشامدهایی که الگوی تکراری دارند، اهداف خود را پیش می‌برد و سریع‌تر از
      انتظار ما رازهای طبیعت را از دل آن بیرون می‌کشد. راه‌حل‌هایی که تست ‌شده و
      مطمئن هستند و می‌توانند سوالاتی با مفاهیم یکسان را حل کنند، الگوریتم
      نامیده می‌شوند. اگر بخواهیم معنی الگوریتم را در زمینه علوم کامپیوتر بررسی
      کنیم، می‌توان گفت الگوریتم‌ها مجموعه فرایندهایی هستند که به کمک آن‌ها
      می‌توان بسیاری از مسائل برنامه‌نویسی را به‌راحتی حل کرد. به‌ عنوان‌ مثال
      الگوریتم یک موتور جستجو را در نظر بگیرید. الگوریتم موتور جستجو گوگل به‌طور
      ساده این‌گونه است که عبارت تایپ شده شما را دریافت کرده، آن را در پایگاه
      داده‌های خود جستجو می‌کند و سپس صفحات وب مربوطه را پیداکرده و به شما نشان
      می‌دهد. این روند کلی از ایجاد سؤال تا رسیدن به پاسخ یک الگوریتم محسوب
      می‌شود. استفاده از الگوریتم‌ها در کاهش هزینه‌های مالی و زمانی یک پروژه
      اهمیت زیادی دارد. الگوریتم‌ها با انجام سلسله اقدامات مشخصی و در ازای گرفتن
      ورودی تعریف ‌شده، نتیجه‌ای مطابق انتظار به ما خواهند داد. اغلب افرادی که
      به فکر شروع یادگیری برنامه نویسی هستند و از ما می‌پرسند که آیا برنامه
      نویسی نیاز به دانشگاه دارد ؟ نمی‌دانند که برنامه نویسی چیست! این ناآشنایی
      موجب ایجاد ترس و سوالات زیاد درمورد برنامه نویسی شده است. جالب است بدانید
      که حتی کودکان هم می‌توانند برنامه نویسی را شروع کنند و در همین لحظه در
      مهدکودک‌های کشورهای به روز دنیا برنامه نویسی در حال تدریس است. برنامه
      نویسی به معنی تبدیل دستورالعمل‌های کامپیوتر به فرمی است که یک ماشین
      می‌تواند آن را درک کند. برنامه‌ها به زبان خاصی نوشته می‌شوند تا خواندن و
      نوشتن را برای انسان آسان کنند. سپس کد کامپایل شده و به یک فایل قابل اجرا
      تبدیل می‌شود که کامپیوتر می‌تواند آن را اجرا کند. بر همین اساس، زبان‌های
      برنامه نویسی مختلفی به وجود آمده است که برخی از محبوب‌ترین آنها عبارتند از
      جاوا، پایتون، PHP، سی، جاوا اسکریپت و… . برای آشنایی بیشتر با برنامه نویسی
      می‌توانید مقاله برنامه نویسی چیست را مطالعه کنید. احتمالا می‌دانید که
      بزرگان دنیای کامپیوتر و فناوری مانند بیل گیتس یا استیو جابز با ترک دانشگاه
      توانستند مسیر موفقیت را طی کنند و به ثروت برسند. البته هزاران مورد هم
      می‌توان مثال زد که به دانشگاه نرفته یا در اواسط تحصیل استعفا داده ولی در
      ادامه هم موفق نشده اند. بیشتر بخوانید : پردرآمدترین زبان برنامه نویسی پس
      تحصیل یا عدم تحصیل ربطی به موفقیت ندارد. همه چیز بستگی به این دارد که چه
      هدفی دارید و چقدر حاضر هستید در راه رسیدن به آن هدف از خودگذشتگی نشان
      دهید. برای رسیدن به یک هدف، چندین روش وجود دارد. اگر می‌خواهید برنامه
      نویسی یاد بگیرید، بهتر است بسته به هدفی که دارید مسیر خود را انتخاب کنید.
      تعدادی از همکاران استیو جابز می‌گویند که او در برخی موارد بسیار خودمحور
      بود و واکنش‌های غیرمعمولی در برابر بعضی اتفاقات داشت اما از این حقیقت آگاه
      بود که گاهی روش‌های کشف نشده، بسیار بهتر از روش‌های آزموده شده ما را به
      هدف می‌رسانند. برای مطالعه بیشتر درمورد استیو جابز به سراغ مقاله درسهایی
      از استیو جابز بروید.
    </article>
  );
};

export default BlogText;
