{
  "courses": [
    {
      "id": "1",
      "img": "../src/assets/images/coursesCards/flutter.png",
      "name": "متخصص فلاتر",
      "category": "برنامه نویسی موبایل",
      "price": 10000,
      "level": "همه سطوح",
      "time": 1,
      "star": 2,
      "teacher": "maximillian",
      "video": "../src/assets/videos/flutter.mp4",
      "introduction": "فلاتر (Flutter) یک فریم ورک متن باز برای ساخت اپلیکیشن‌های موبایل است. این کتابخانه توسط شرکت گوگل در سال 2017 معرفی شد و در مقایسه با React یا سایر فریم ورک‌های ساخت اپلیکیشن مبتنی بر موبایل عمر زیادی ندارد. فلاتر با زبان برنامه نویسی دارت نوشته شده است، یک زبان چندمنظوره و شی گراء که هنوز آنطور که باید و شاید بر سر زبان‌ها نیفتاده و محبوبیت زیادی ندارد. با یادگیری زبان دارت و فریم ورک فلاتر می‌توانید برای اندروید و iOS اپلیکیشن بسازید. جالب است بدانید علی بابا، یکی از بزرگترین شرکت‌های چینی در دنیا به فلاتر اعتماد کرده و اپلیکیشن خود را با این فریم ورک ساخته است. در این مطلب بررسی خواهیم کرد که فریم ورک Flutter چیست و چه کاربردهایی دارد.",
      "desc": "راهنمای کامل Flutter SDK &amp; Flutter Framework برای ساخت برنامه های بومی iOS و Android"
    },
    {
      "id": "2",
      "img": "../src/assets/images/coursesCards/python.png",
      "name": "آموزش Python",
      "category": "برنامه نویسی",
      "price": 0,
      "level": "مقدماتی",
      "time": 10,
      "star": 3.5,
      "video": "../src/assets/videos/python.mp4",
      "teacher": "jose",
      "introduction": "پایتون یک زبان برنامه نویسی همه منظوره، شی گرا و سطح بالا است. چه در زمینه هوش مصنوعی یا امور مالی کار می کنید و یا به دنبال حرفه ای در توسعه وب یا علم داده هستید، پایتون یکی از مهم ترین مهارت هایی است که می توانید یاد بگیرید. سینتکس ساده پایتون به ویژه برای برنامه های دسکتاپ، وب و کسب و کار مناسب است. فلسفه طراحی پایتون بر خوانایی و قابلیت استفاده تاکید دارد. پایتون با این فرض توسعه داده شد که باید تنها یک راه (و ترجیحاً یک راه واضح) برای انجام کارها وجود داشته باشد، فلسفه ای که منجر به سطح سختی از استانداردسازی کد شد. زبان برنامه نویسی اصلی بسیار کوچک است و کتابخانه استاندارد نیز بزرگ است. در واقع، کتابخانه بزرگ پایتون یکی از بزرگترین مزایای آن است که ابزارهای مختلفی را برای برنامه نویسان مناسب برای وظایف مختلف فراهم می کند.",
      "desc": "پایتون را مانند یک شروع حرفه ای از اصول اولیه بیاموزید و تمام راه را تا ایجاد برنامه ها و بازی های خود ادامه دهید."
    },
    {
      "id": "3",
      "name": "آموزش Angular",
      "img": "../src/assets/images/coursesCards/angular.png",
      "category": "طراحی وب",
      "price": 234000,
      "level": "پیشرفته",
      "time": 9,
      "star": 5,
      "video": "../src/assets/videos/angular.mp4",
      "teacher": "maximillian",
      "introduction": "Angular معامله بزرگ بعدی است. به عنوان جانشین فریمورک بسیار موفق Angular.js، مطمئناً آینده توسعه frontend را به روشی مشابه شکل خواهد داد. ویژگی ها و قابلیت های قدرتمند Angular به شما اجازه می دهد تا برنامه های وب پیچیده، قابل تنظیم، مدرن، پاسخگو و کاربر پسند ایجاد کنید. Angular سریعتر از Angular 1 است و رویکرد توسعه بسیار انعطاف پذیرتر و ماژولار را ارائه می دهد. پس از گذراندن این دوره، می‌توانید به طور کامل از تمام آن ویژگی‌ها استفاده کنید و بلافاصله شروع به توسعه برنامه‌های کاربردی عالی کنید. با توجه به تفاوت‌های شدید بین Angular 1 و Angular (= Angular 2+) نیازی نیست چیزی در مورد Angular بدانید. .js تا بتوانید از این دوره بهره مند شوید و پروژه های آینده خود را با Angular بسازید.",
      "desc": "استاد Angular (قبلا Angular 2) و ساخت برنامه های وب عالی و واکنشی با جانشین Angular.js"
    },
    {
      "id": "4",
      "img": "../src/assets/images/coursesCards/photoshaop.png",
      "name": "آموزش Photoshop",
      "category": "گرافیک",
      "price": 0,
      "level": "متوسط",
      "time": 44,
      "star": 4.7,
      "video": "../src/assets/videos/photoshap.mp4",
      "teacher": "walter",
      "introduction": "در این دوره هر آنچه را که باید در مورد شروع کار با فتوشاپ بدانید را به شما آموزش می دهم. شما یاد خواهید گرفت که چگونه از فتوشاپ برای استفاده در طراحی گرافیک و برای روتوش فتوشاپ استفاده کنید. شما پروژه های زیادی را ایجاد خواهید کرد که می توانید برای کمک به اشتغال خود به مجموعه خود اضافه کنید.",
      "desc": "این دوره آموزشی Adobe Photoshop Essentials به شما آموزش روتوش فتوشاپ و همچنین فتوشاپ برای طراحی گرافیکی می دهد."
    },
    {
      "id": "5",
      "img": "../src/assets/images/coursesCards/bootstrap.png",
      "name": "آموزش Bootstrap",
      "category": "برنامه نویسی فرانت",
      "price": 333333,
      "level": "متوسط",
      "time": 32,
      "star": 1.3,
      "video": "../src/assets/videos/Bootstrap.mp4",
      "teacher": "brad",
      "introduction": "این دوره برای کسانی است که می خواهند یاد بگیرند که چگونه وب سایت ها و رابط های کاربری مدرن با استفاده از چارچوب Bootstrap CSS بسازند. این دوره بسیار مناسب برای مبتدیان است، اما برای هر کسی که می خواهد پروژه های جالبی بسازد نیز مناسب است. ما با یادگیری تمام کلاس های مهم بوت استرپ، ابزارهای کمکی، راهنماها و غیره با استفاده از جعبه شنی Bootstrap شروع خواهیم کرد. این مجموعه ای از فایل هایی است که برای کامپوننت ها و قسمت های خاصی مانند دکمه ها، تایپوگرافی، ستون های شبکه، فلکس و غیره دسته بندی شده اند. شما یک نسخه شروع بدون کلاس خواهید داشت و ما کلاس ها را مرور می کنیم و اضافه می کنیم و در مورد آنها صحبت می کنیم. در برخی موارد CSS را بررسی کنید. ما از sandbox برای همه اجزای CSS و همچنین ویجت‌های جاوا اسکریپت مانند چرخ فلک، آکاردئون، اعلان‌های نان تست و غیره استفاده خواهیم کرد.",
      "desc": "با استفاده از Bootstrap 5، سفارشی سازی و ساخت وب سایت های مدرن را از ابتدا یاد بگیرید"
    },
    {
      "id": "6",
      "img": "../src/assets/images/coursesCards/reactnative.png",
      "name": "آموزش React-native",
      "category": "برنامه نویسی موبایل",
      "price": 321000,
      "level": "پیشرفته",
      "time": 19,
      "star": 3.4,
      "video": "../src/assets/videos/react-native.mp4",
      "teacher": "maximillian",
      "introduction": "نیازی به یادگیری جاوا، اندروید، سوئیفت، ObjectiveC یا هر چیز دیگری نیست - React و جاوا اسکریپت تمام چیزی است که برای ایجاد اپلیکیشن‌های بومی موبایل عالی که هم روی اندروید و هم در iOS کار می‌کنند، نیاز دارید. احتمالاً به همین دلیل است که اینستاگرام، AirBnB، اسکایپ و بسیاری دیگر از شرکت های جهانی از آن برای ساخت برنامه های تلفن همراه خود استفاده می کنند! با این دوره می توانید به این لیگ بپیوندید. من تمام آنچه را که برای ایجاد برنامه‌های React Native نیاز دارید، به شما آموزش می‌دهم، آنها را در فروشگاه Google Play و Apple App Store منتشر می‌کنید و عمیقاً در اکوسیستم React Native فرو می‌روید.",
      "desc": "از React Native و دانش React خود برای ساخت برنامه‌های بومی iOS و Android - از جمله. Push Notifications، Hooks، Redux"
    },
    {
      "id": "7",
      "img": "../src/assets/images/coursesCards/asp.png",
      "name": "آموزش ASP.Net",
      "category": "برنامه نویسی بک",
      "price": 3461000,
      "level": "همه سطوح",
      "time": 11,
      "star": 4.9,
      "video": "../src/assets/videos/asp.mp4",
      "teacher": "mosh",
      "introduction": "این یک دوره آموزشی سطح مبتدی تا پیشرفته در دات نت 8 است که شما را از اصول اولیه تا حالت پیشرفته می برد. این دوره برای کسانی است که تازه با ASP.NET Core آشنا هستند یا با ASP.NET آشنا هستند و می خواهند اولین قدم را در درک تفاوت های ASP.NET Core انجام دهند. از آنجا ما پروژه های متعددی را برای درک همه مفاهیم در دات نت 8 می سازیم زیرا برنامه نهایی خود را در Azure و همچنین IIS مستقر خواهیم کرد.",
      "desc": "برنامه تجارت الکترونیک دنیای واقعی را با استفاده از ASP.NET Core MVC، Entity Framework Core و ASP.NET Core Identity بسازید."
    },
    {
      "id": "8",
      "img": "../src/assets/images/coursesCards/node.png",
      "name": "آموزش NodeJs",
      "category": "برنامه نویسی بک",
      "price": 982222,
      "level": "مقدماتی",
      "time": 39,
      "star": 3.9,
      "teacher": "jonas",
      "video": "../src/assets/videos/nodejs.mp4",
      "introduction": "این دوره هم مثل بقیه دوره های من کاملا پروژه محور است! و نه هر پروژه ای: این یک برنامه کامل، زیبا و با ویژگی های غنی است که هم دارای یک API RESTful و هم یک وب سایت ارائه شده از سمت سرور است. این فوق‌العاده‌ترین و کامل‌ترین پروژه‌ای است که در هر دوره Node.js در اینترنت پیدا می‌کنید! با ساختن این پروژه عظیم، تمام مهارت‌هایی را که برای برنامه‌ریزی، ساخت و به کارگیری پشتیبان مدرن خود نیاز دارید، یاد خواهید گرفت. پایان برنامه ها با Node.js و فناوری های مرتبط.",
      "desc": "Master Node JS & Deno.js، API های REST را با Node.js، API های GraphQL بسازید، Authentication را اضافه کنید، از MongoDB، SQL و موارد دیگر استفاده کنید!"
    },
    {
      "id": "9",
      "img": "../src/assets/images/coursesCards/react.png",
      "name": "آموزش React",
      "category": "برنامه نویسی فرانت",
      "price": 3244560,
      "level": "متوسط",
      "star": 4.5,
      "time": 36,
      "video": "../src/assets/videos/React.mp4",
      "teacher": "jonas",
      "introduction": "در سال 2023، React هنوز هم مهارت شماره 1 است که باید یاد بگیرید اگر می‌خواهید یک توسعه‌دهنده موفق باشید! اما ممکن است سخت باشد. قطعات متحرک زیادی وجود دارد، کتابخانه‌های مختلف، آموزش‌های زیادی وجود دارد. این دوره آموزشی نهایی React برای سال 2024 و فراتر از آن است. یک رویکرد تمرینی سنگین برای تسلط بر React با ساخت برنامه‌های صیقلی، پشتیبان‌گیری شده توسط نمودارها، تئوری، و نگاه‌های زیر پوشش React. بسته یکپارچه که شما را از بدون درک واقعی React و ساختن برنامه های وب مدرن، قدرتمند و حرفه ای. پروژه های واقعی. توضیحات واقعی واکنش واقعی",
      "desc": "استاد مدرن React از مبتدی تا پیشرفته! Context API، React Query، Redux Toolkit، Tailwind، الگوهای پیشرفته"
    },
    {
      "id": "10",
      "img": "../src/assets/images/coursesCards/bigdata.png",
      "name": "متخصص مهندسی داده و بیگ دیتا",
      "category": "هوش مصنوعی",
      "price": 4521022,
      "level": "مقدماتی",
      "time": 33,
      "star": 4.1,
      "video": "../src/assets/videos/big-data.mp4",
      "teacher": "کاویانی",
      "introduction": "داده‌ها به عنوان یکی از اصلی‌ترین عناصر در کسب و کارهای مدرن محسوب می‌شوند. کسب و کارها با استفاده از این داده‌ها تصمیم‌گیری‌های خود را انجام می‌دهند و جنگی پنهان برای به دست آوردن هر چه بیشتر داده‌ها در حال انجام است. هر چه یک کسب و کار داده‌های بیشتر و حجیم‌تری داشته باشد و بتواند این داده‌ها را با سرعت پردازش کند، می‌تواند قدرت بیشتری در تشخیص رفتار کاربران، پیش‌بینی آینده و محاسبات مربوط به کسب و کار داشته باشد.  در این حوزه، چالش اصلی ذخیره و پردازش داده‌هاست. حجم عظیمی از داده‌ها برای ذخیره و پردازش نیازمند روش‌ها و تکنیک‌های خاصی برای پردازش هستند. و این در حالیست که روش‌های سنتی قادر به ذخیره و پردازش این حجم عظیم از داده‌ها نیستند. برای همین بایستی برای ذخیره و پردازش این حجم از داده‌ها از روش‌های مدرن‌تر که معمولا در حوزه مهندسی داده و بیگ دیتا مورد بحث و بررسی قرار می‌گیرد، استفاده کرد.",
      "desc": "آموزش مهندسی داده و Hadoop با MapReduce، HDFS، Spark، Flink، Hive، HBase، MongoDB، Cassandra، Kafka + موارد دیگر!"
    },
    {
      "id": "11",
      "img": "../src/assets/images/coursesCards/django.png",
      "name": "متخصص پایتون توسعه وب",
      "category": "برنامه نویسی بک",
      "price": 322000,
      "level": "همه سطوح",
      "star": 3,
      "time": 55,
      "video": "../src/assets/videos/django.mp4",
      "teacher": "کاویانی",
      "introduction": "شاید این سوال برای شما که علاقه مند به یادگیری پایتون هستید پیش بیاید که بهترین پکیج برنامه نویسی پایتون چیست؟ این سوال را با یک مثال پاسخ می‌دهم . فرض کنید شما قصد دارید خلبان شوید و در دوره‌های خلبانی شرکت کردید و نمره بالایی گرفتید حتی با هواپیما‌های مجازی هم پرواز کردید آیا می‌توان به شما گفت خلبان وقتی که هنوز پرواز واقعی نکردید؟ پاسخ واضح است ، خیر.    به عقیده ما بهترین پکیج برنامه نویسی پایتون هم باید چنین شرایطی داشته باشد یعنی نه تنها آموزش‌های تئوری را به شما یاد دهد بلکه شما را به سرحدی برساند که بتوانید پروژه واقعی بگیرید یا در شرکتی استخدام شوید.",
      "desc": "آموزش ساخت برنامه های کاربردی وب و وب سایت با پایتون و چارچوب جنگو"
    },
    {
      "id": "12",
      "img": "../src/assets/images/coursesCards/java.png",
      "name": "متخصص جاوا",
      "category": "برنامه نویسی",
      "price": 0,
      "level": "مقدماتی",
      "time": 22,
      "star": 2.9,
      "video": "../src/assets/videos/java.mp4",
      "teacher": "jose",
      "introduction": "تا اینکه یک روز در زندگی من اتفاق خاصی افتاد. یک نفر جدید وارد زندگی من شد. نیکلاس, مدیر پروژه جدید ما بود که بر خلاف خیلی از مدیران دیگه بلد بود کد بزنه و در پروژه با ما همکاری میکرد. یک روز صبح همه اعضای تیم رو جمع کرد و از ما خواست تا کدی که خودمون با دستان خودمون نوشته بودیم رو بخونیم و بگیم این کد چه کاری انجام میده. کد بسیار ناخوانا بود و زمان زیادی از ما گرفت تا اون رو متوجه بشیم. نیکلاس به ما گفت من این کد رو تغییر میدم و فردا بهتون یک کد جدید نشون میدم. کد نیکلاس به طرز عجیبی خوانا بود. ",
      "desc": "کسب مهارت های کلیدی جاوا: از اصول اولیه تا برنامه نویسی پیشرفته و amp; صدور گواهینامه - شغل توسعه دهنده خود را شروع کنید"
    },
    {
      "id": "13",
      "img": "../src/assets/images/coursesCards/datascience.png",
      "name": "متخصص یادگیری ماشین و علم داده",
      "category": "هوش مصنوعی",
      "price": 338800,
      "level": "پیشرفته",
      "time": 20,
      "star": 4.8,
      "video": "../src/assets/videos/datascience.mp4",
      "teacher": "کاویانی",
      "introduction": "داده کاوی و یادگیری ماشین زمانی جذاب است که شما یک تحلیل‌گر داده حرفه‌ای باشید و نه فقط در آرزوی انجام آن. اگر می‌خواهید‌ از الان تا آینده خیال‌تان را بابت داشتن یک شغل خوب و خوش‌درآمد در هرجای جهان راحت کنید و با خیال آسوده پیر شوید، یادگیری داده کاوی و ماشین لرنینگ همان مهارتی‌ست که جادوگرها در گوی آینده‌نمای خود می‌بینند. آموزش پایتون برای داده‌کاوی چیزی‌ست که بلندپروازها و افراد جسور نمی‌توانند در برابر یادگیری آن مقاومت کنند. حالا که در انتخاب این حوزه جسارت لازم را دارید، بهتر است ادامه راه را هم بررسی کنیم و ببینیم چه مسیر مطمئنی برای یادگیری علم داده با پایتون در پیش‌رو داریم.",
      "desc": "آموزش کامل علوم داده: ریاضی، آمار، پایتون، آمار پیشرفته در پایتون، ماشین و یادگیری عمیق"
    },
    {
      "id": "14",
      "img": "../src/assets/images/coursesCards/linux.png",
      "name": "متخصص لینوکس",
      "category": "برنامه نویسی",
      "price": 3210000,
      "level": "همه سطوح",
      "time": 40,
      "star": 4.3,
      "video": "../src/assets/videos/linux.mp4",
      "teacher": "mosh",
      "introduction": "احتمالا وقتی این متن را می‌خوانید، در حال استفاده از سیستم عامل ویندوز هستید. قطعا ویندوز برای استفاده روزمره برای خیلی از ما ساده‌تر هست و همه به استفاده از آن عادت داریم اما وقتی صحبت از راه‌اندازی سرویس‌های مختلف بر روی سرور و ارائه خدمات مختلف می‌شود، حتما اسم سیستم عامل لینوکس هم به میان می‌آید، پس باید خیلی خوب لینوکس را بشناسیم و بتوانیم از آن استفاده کنیم. جالب است بدانید که درصد خیلی بالایی از سرورهای دنیا، از جمله وب سرورها، DNS سرورها، File سرورها و خیلی از سوپر کامپیوترهای دنیا بر پایه سیستم عامل لینوکس هستند. همچنین در چند سال اخیر با عرضه نرم افزارهای DevOps و سرویس‌های کلاودی مختلف، لینوکس نقش خیلی پررنگ‌تری نسبت به قبل پیدا کرده است.",
      "desc": "بهترین دوره مدیریت لینوکس که شما را برای مشاغل شرکتی و گواهینامه های RHCSA، RHCE، LFCS، CLNP آماده می کند."
    }
  ],
  "blogs": [
    {
      "id": "1",
      "name": "مقاله 1",
      "category": "برنامه نویسی",
      "summary": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ است.",
      "date": "5 خرداد 1401",
      "img": "../src/assets/img/beautiful-pet-1.jpg"
    },
    {
      "id": "2",
      "name": "مقاله 2",
      "category": "شبکه",
      "summary": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ است.",
      "date": "5 خرداد 1401",
      "img": "../src/assets/img/beautiful-pet-2.jpg"
    },
    {
      "id": "3",
      "name": "مقاله 3",
      "category": "طراحی وب",
      "summary": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ است.",
      "date": "5 خرداد 1401",
      "img": "../src/assets/img/beautiful-pet-3.jpg"
    },
    {
      "id": "4",
      "name": "مقاله 4",
      "category": "هوش مصنوعی",
      "summary": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ است.",
      "date": "5 خرداد 1401",
      "img": "../src/assets/img/beautiful-pet-4.jpg"
    },
    {
      "id": "5",
      "name": "مقاله 5",
      "category": "هوش مصنوعی",
      "summary": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ است.",
      "date": "5 خرداد 1401",
      "img": "../src/assets/img/beautiful-pet-4.jpg"
    },
    {
      "id": "6",
      "name": "مقاله 6",
      "category": "شبکه",
      "summary": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ است.",
      "date": "5 خرداد 1401",
      "img": "../src/assets/img/beautiful-pet-2.jpg"
    },
    {
      "id": "7",
      "name": "مقاله 7",
      "category": "طراحی وب",
      "summary": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ است.",
      "date": "5 خرداد 1401",
      "img": "../src/assets/img/beautiful-pet-1.jpg"
    },
    {
      "id": "8",
      "name": "مقاله 8",
      "category": "طراحی وب",
      "summary": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ است.",
      "date": "5 خرداد 1401",
      "img": "../src/assets/img/beautiful-pet-3.jpg"
    },
    {
      "id": "9",
      "name": "مقاله 9",
      "category": "شبکه",
      "summary": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ است.",
      "date": "5 خرداد 1401",
      "img": "../src/assets/img/beautiful-pet-3.jpg"
    },
    {
      "id": "10",
      "name": "مقاله 10",
      "category": "هوش مصنوعی",
      "summary": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ است.",
      "date": "5 خرداد 1401",
      "img": "../src/assets/img/beautiful-pet-4.jpg"
    },
    {
      "id": "11",
      "name": "مقاله 11",
      "category": "شبکه",
      "summary": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ است.",
      "date": "5 خرداد 1401",
      "img": "../src/assets/img/beautiful-pet-2.jpg"
    },
    {
      "id": "12",
      "name": "مقاله 12",
      "category": "شبکه",
      "summary": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ است.",
      "date": "5 خرداد 1401",
      "img": "../src/assets/img/beautiful-pet-1.jpg"
    },
    {
      "id": "13",
      "name": "مقاله 13",
      "category": "طراحی وب",
      "summary": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ است.",
      "date": "5 خرداد 1401",
      "img": "../src/assets/img/beautiful-pet-1.jpg"
    },
    {
      "id": "14",
      "name": "مقاله 14",
      "category": "طراحی وب",
      "summary": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ است.",
      "date": "5 خرداد 1401",
      "img": "../src/assets/img/beautiful-pet-4.jpg"
    },
    {
      "id": "15",
      "name": "مقاله 15",
      "category": "هوش مصنوعی",
      "summary": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ است.",
      "date": "5 خرداد 1401",
      "img": "../src/assets/img/beautiful-pet-2.jpg"
    },
    {
      "id": "16",
      "name": "مقاله 16",
      "category": "شبکه",
      "summary": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ است.",
      "date": "5 خرداد 1401",
      "img": "../src/assets/img/beautiful-pet-1.jpg"
    },
    {
      "id": "17",
      "name": "مقاله 17",
      "category": "برنامه نویسی",
      "summary": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ است.",
      "date": "5 خرداد 1401",
      "img": "../src/assets/img/beautiful-pet-4.jpg"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "maximillian",
      "avatar": "../src/assets/images/teachers/maximillian.jpg",
      "specialty": "full stack developer",
      "courses": [
        "1",
        "3",
        "6"
      ],
      "about": "Academind با مجموعه دوره ها و دانش مربیان موفق، تلاش می کند تا آموزش آنلاین با کیفیت بالا ارائه دهد. آموزش آنلاین، موفقیت در زندگی واقعی - این چیزی است که Academind مخفف آن است. موضوعاتی مانند توسعه وب، تجزیه و تحلیل داده ها و موارد دیگر را به شیوه ای سرگرم کننده و جذاب بیاموزید. ما به بیش از 2,000,000 دانش آموز در مورد موضوعات مختلف آموزش داده ایم. ما دوست داریم به شما نیز آموزش دهیم! :) به یادگیری ادامه دهید!"
    },
    {
      "id": "2",
      "name": "jose",
      "avatar": "../src/assets/images/teachers/jose.jpg",
      "specialty": "python and java developer",
      "courses": [
        "2",
        "12"
      ],
      "about": "خوزه مارسیال پورتیلا دارای مدرک کارشناسی و کارشناسی ارشد مهندسی مکانیک از دانشگاه سانتا کلارا و سالها تجربه به عنوان مربی و مربی حرفه ای برای علوم داده، یادگیری ماشین و برنامه نویسی پایتون است. او دارای انتشارات و پتنت هایی در زمینه های مختلف مانند میکروسیال، علم مواد و علم داده است. او در طول دوران حرفه‌ای خود مجموعه‌ای مهارت در تجزیه و تحلیل داده‌ها ایجاد کرده است و امیدوار است از تجربیات خود در آموزش و علم داده برای کمک به افراد دیگر در یادگیری قدرت برنامه‌نویسی، توانایی تجزیه و تحلیل داده‌ها و مهارت‌های مورد نیاز برای ارائه اطلاعات استفاده کند. داده ها در تجسم های واضح و زیبا. در حال حاضر او به عنوان رئیس علوم داده برای آموزش Pierian کار می کند و دوره های آموزشی دانش داده و برنامه نویسی پایتون را به کارمندان شاغل در شرکت های برتر از جمله جنرال الکتریک، سیگنا، SalesForce، Starbucks، McKinsey و بسیاری دیگر ارائه می دهد. برای کسب اطلاعات بیشتر در مورد پیشنهادات آموزشی، می توانید لینک وب سایت را بررسی کنید."
    },
    {
      "id": "3",
      "name": "brad",
      "avatar": "../src/assets/images/teachers/brad.jpg",
      "specialty": "frontend developer",
      "courses": [
        "4"
      ],
      "about": "برد تراورسی حدود 12 سال است که برنامه نویسی می کند و تقریباً 5 سال است که تدریس می کند. او مالک Traversy Media است که یک کانال توسعه وب موفق در یوتیوب است و در همه چیز از HTML5 گرفته تا فریم ورک های فرانت اند مانند Angular و همچنین فناوری های سمت سرور مانند Node.js، PHP و Python تخصص دارد. براد در توضیح موضوعات بسیار پیچیده به روشی ساده که بسیار قابل درک است تسلط دارد. با تماشای دوره های براد روی دانش خود سرمایه گذاری کنید."
    },
    {
      "id": "4",
      "name": "jonas",
      "avatar": "../src/assets/images/teachers/jonas.jpg",
      "specialty": "full stack developer",
      "courses": [
        "8",
        "9"
      ],
      "about": "سلام، من جوناس هستم! من یکی از مربیان برتر Udemy هستم و تمام دوره‌های ممتاز من به دلیل عملکرد فوق‌العاده و رضایت دانش‌آموز، موقعیت پرفروش را کسب کرده‌اند. من یک توسعه‌دهنده و طراح وب تمام پشته هستم که علاقه زیادی به ساخت رابط‌های وب زیبا از ابتدا دارم. من از سال 2010 وب‌سایت‌ها و برنامه‌های کاربردی می‌سازم و همچنین دارای مدرک کارشناسی ارشد در رشته مهندسی هستم. اشتیاق خود را برای تدریس و کمک به دیگران با به اشتراک گذاشتن همه چیزهایی که در دوران کالج می‌دانستم کشف کردم. این اشتیاق من را در سال 2015 به Udemy هدایت کرد، جایی که اکنون این امتیاز را دارم که بیش از 1,500,000 زبان آموز در زمینه توسعه وب آموزش دهم."
    },
    {
      "id": "5",
      "name": "mosh",
      "avatar": "../src/assets/images/teachers/mosh.jpg",
      "specialty": "back-end and linux developer",
      "courses": [
        "7",
        "14"
      ],
      "about": "سلام! اسم من مش (مشفق) همدانی است! من یک مهندس نرم افزار پرشور با دو دهه تجربه هستم و به بیش از 3 میلیون نفر آموزش داده ام که چه کسی کدنویسی کنند یا چگونه مهندس نرم افزار حرفه ای شوند از طریق کانال YouTube و دوره های آنلاین خود. هدف من این است که مهندسی نرم افزار را سرگرم کننده و در دسترس قرار دهم. هر کس. به همین دلیل دوره های من ساده، عملی و بدون BS هستند."
    },
    {
      "id": "6",
      "name": "کاویانی",
      "avatar": "../src/assets/images/teachers/kaviani.jpg",
      "specialty": "data scientist and django developer",
      "courses": [
        "10",
        "11",
        "12"
      ],
      "about": "دانشمند ارشد داده در فیلیمو و آپارات (filimo.com/aparat.com) مهندس یادگیری ماشین کمپانی زبراکت برلین، آلمان (zebracat.ai) مهندس داده زیرساخت ذخیره‌سازی ابری پارس‌پک (parspack.com) استاد مدعو دانشگاه شهید رجایی، مدرس علم داده در جهاد دانشگاهی صنعتی شریف و مدرس یادگیری ماشین دانشگاه خواجه نصیر مشاور و مدرس داده‌کاوی فاوا شهرداری تهران، داروسازی دکتر عبیدی، شهرک تحقیقاتی صنعتی اصفهان، شرکت نفت پارس و بیمه سامان مدیر واحد داده‌کاوی در سامانه خبرفارسی (khabarfarsi.com) بنیان‌گذار پروژه‌ی آموزشی چیستیو (chistio.ir) دارنده‌ی مدال کارآفرینی از کمپانی گوگل در مسابقات جهانی جی‌اس‌بی (startup.google.com) برنامه‌نویس ارشد شرکت فناوری اطلاعات ثانیه، مجری پروژه‌های هوشمندسازی راه‌آهن جمهوری اسلامی ایران، سامانه برنامه‌ریزی هوشمند دانشگاهی ترنج و سازمان بنادر کل کشور (saniehco.com) برنامه‌نویس پایتون و پی‌اچ‌پی در شرکت جویشگر پردیس ارم (jooyeshgar.com) و شرکت پدیده تجارت جاویدان (padideit.com)"
    },
    {
      "id": "7",
      "name": "walter",
      "avatar": "../src/assets/images/teachers/wolter.jpg",
      "specialty": "graphist",
      "courses": [
        "3"
      ],
      "about": "به اشتراک گذاشتن چیزی است که من هستم، و تدریس جایی است که در بهترین حالتم هستم، زیرا من در هر دو طرف این معادله بوده ام، و دریافت آموزش های مفید راه معنادار من برای عضویت در جامعه خلاق است. زمان زیادی را صرف تماشای یادگیری و آموزش دیگران کردم تا نحوه کار من با شما را اصلاح کنم تا کارآمد، مفید و مهمتر از همه به یاد ماندنی باشم. من می خواهم آنچه را که به شما نشان داده ام به آینده ای روشن منتقل کنید. من یک همسر (دختر دوست داشتنی ایرلندی) و بچه دارم. من در بسیاری از مکان‌ها زندگی و کار کرده‌ام (همانطور که کیوی‌ها تمایل دارند) - اما بیشتر ۱۴ سال خلق و تدریس من یک موضوع مهم داشته است: همراهی دیگران برای سوار شدن در حالی که همه ما سعی می‌کنیم دنیا را با داستان‌هایمان تغییر دهیم. من یک مربی معتبر Adobe (ACI) در ایرلند هستم. من همچنین یک متخصص Adobe Certified (ACE) هستم و دوره آموزشی Adobe Certified Associate (ACA) را گذرانده ام. و من فقط Adobe کار نمی کنم. به یاد داشته باشید، رسانه یک اصطلاح بسیار گسترده است - دیجیتال مرزها را منفجر کرد، بنابراین همه ما دائماً در حال یادگیری هستیم."
    }
  ],
  "books": [
    {
      "id": "1",
      "img": "../src/assets/images/books/ai.jpg",
      "title": "AI Book 1",
      "category": "AI",
      "dec": "با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است."
    },
    {
      "id": "2",
      "img": "../src/assets/images/books/ai4.jpg",
      "title": "AI Book 2",
      "category": "AI",
      "dec": "با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است."
    },
    {
      "id": "3",
      "img": "../src/assets/images/books/algorithm.jpg",
      "title": "Algorithm Book ",
      "category": "Algorithm",
      "dec": "با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است."
    },
    {
      "id": "4",
      "img": "../src/assets/images/books/backend.jpg",
      "title": "backend Book ",
      "category": "backend",
      "dec": "با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است."
    },
    {
      "id": "5",
      "img": "../src/assets/images/books/front3.jpg",
      "title": "front Book 1",
      "category": "front",
      "dec": "با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است."
    },
    {
      "id": "6",
      "img": "../src/assets/images/books/front.jpg",
      "title": "front Book 2",
      "category": "front",
      "dec": "با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است."
    },
    {
      "id": "7",
      "img": "../src/assets/images/books/front2.jpg",
      "title": "front Book 3",
      "category": "front",
      "dec": "با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است."
    },
    {
      "id": "8",
      "img": "../src/assets/images/books/hack.jpg",
      "title": "hacking Book 1",
      "category": "hacking",
      "dec": "با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است."
    },
    {
      "id": "9",
      "img": "../src/assets/images/books/hack3.jpg",
      "title": "hacking Book 2",
      "category": "hacking",
      "dec": "با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است."
    },
    {
      "id": "10",
      "img": "../src/assets/images/books/java.jpg",
      "title": "java Book ",
      "category": "java",
      "dec": "با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است."
    },
    {
      "id": "11",
      "img": "../src/assets/images/books/javascript.jpg",
      "title": "javascript Book ",
      "category": "javascript",
      "dec": "با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است."
    },
    {
      "id": "12",
      "img": "../src/assets/images/books/kali4.jpg",
      "title": "kali Book ",
      "category": "kali",
      "dec": "با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است."
    },
    {
      "id": "13",
      "img": "../src/assets/images/books/linux2.jpg",
      "title": "linux Book",
      "category": "linux",
      "dec": "با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است."
    },
    {
      "id": "14",
      "img": "../src/assets/images/books/mobile.jpg",
      "title": "mobile Book 1",
      "category": "mobile",
      "dec": "با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است."
    },
    {
      "id": "15",
      "img": "../src/assets/images/books/mobile2.jpg",
      "title": "mobile Book 2",
      "category": "mobile",
      "dec": "با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است."
    },
    {
      "id": "16",
      "img": "../src/assets/images/books/programming2.jpg",
      "title": "programming Book 1",
      "category": "programming",
      "dec": "با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است."
    },
    {
      "id": "17",
      "img": "../src/assets/images/books/python.jpg",
      "title": "python Book 1",
      "category": "python",
      "dec": "با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است."
    },
    {
      "id": "18",
      "img": "../src/assets/images/books/ubuntu3.jpg",
      "title": "ubuntu Book 1",
      "category": "ubuntu",
      "dec": "با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است."
    },
    {
      "id": "19",
      "img": "../src/assets/images/books/web3.jpg",
      "title": "web Book 1",
      "category": "web",
      "dec": "با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است."
    }
  ],
  "users": [
    {
      "id": "17c0",
      "email": "mahdiar55582@gmail.com",
      "userName": "mahdiar",
      "password": "mahdiar5582",
      "confirmPassword": "mahdiar5582",
      "courses": [],
      "registrationDate": "2024-02-20T15:06:21.449Z"
    },
    {
      "id": "6569",
      "email": "linddhv@gmail.com",
      "userName": "mamd",
      "password": "mamad123",
      "confirmPassword": "mamad123",
      "courses": [],
      "registrationDate": "2024-02-20T15:10:57.644Z"
    },
    {
      "id": "081f",
      "email": "hamid@gmail.com",
      "userName": "hamid",
      "password": "hamid123",
      "confirmPassword": "hamid123",
      "courses": [],
      "registrationDate": "2024-02-21T16:26:12.833Z"
    },
    {
      "id": "53cb",
      "email": "asghar@gmail.com",
      "userName": "asghar",
      "password": "asghar123",
      "confirmPassword": "asghar123",
      "courses": [],
      "registrationDate": "2024-02-26T12:44:57.574Z"
    },
    {
      "id": "735c",
      "email": "mehrzad@gmail.com",
      "userName": "mehrzad",
      "password": "mehrzad123",
      "confirmPassword": "mehrzad123",
      "courses": [],
      "registrationDate": "2024-03-01T14:55:49.244Z"
    }
  ]
}